literate/50-project.org
#+OPTIONS: :toc 2
#+DESCRIPTION: Configuration for Project
#+DATE: 2025-06-04 00:20:13
#+AUTHOR: mistertuna93
#+TITLE: Project
#+PROPERTY: header-args:emacs-lisp :tangle ../elisp/50-project.el
#+TAGS[]: emacs config
#+ALIASES[]: /.emacs.default/50-projects.html

* Projectile
#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :diminish projectile-mode
  :init
  (projectile-mode +1)
  :config
  (setq projectile-completion-system 'default
        projectile-project-search-path '("~/projects/"))
  :bind-keymap
  ("C-c p" . projectile-command-map))
#+end_src

* Treemacs Projectile Integration
#+begin_src emacs-lisp
(use-package treemacs-projectile
  :after (treemacs projectile)
  :ensure t)
#+end_src

* Magit
#+begin_src emacs-lisp
(use-package magit
  :ensure t
  :commands magit-status
  :bind (("C-x g" . magit-status)))
#+end_src

* Treemacs Magit Integration
#+begin_src emacs-lisp
(use-package treemacs-magit
  :after (treemacs magit)
  :ensure t)
#+end_src

* Forge (GitHub/GitLab integration)
#+begin_src emacs-lisp
(use-package forge
  :after magit
  :ensure t)
#+end_src

* Diff Highlighting
#+begin_src emacs-lisp
(use-package diff-hl
  :ensure t
  :hook ((prog-mode . diff-hl-mode)
         (magit-post-refresh . diff-hl-magit-post-refresh)))
#+end_src

* Consult Project Extras
#+begin_src emacs-lisp
(use-package consult-project-extra
  :ensure t)
#+end_src

* Browse at Remote
#+begin_src emacs-lisp
(use-package browse-at-remote
  :ensure t)
#+end_src

* VC-MSG
#+begin_src emacs-lisp
(use-package vc-msg
  :ensure t)
#+end_src
